print("БАЗОВІ ТИПИ ДАНИХ")
data_types = {
    "str": {"тип даних - рядки (від англ. string — рядок)"
            " Значенням величини типу str є послідовність символів,"
            " яку у виразах беруть в одинарні або подвійні лапки"},
    "int": {"тип даних - чисел (від англ. integer - ціле число) - позитивні і негативні цілі числа,"
            " а також 0 (наприклад, 4, 687, -45, 0)"},
    "float": {"тип даних - чисел (від англ. floating - плаваючий) Числа з плаваючою крапкою (float point) "
              "- дробові числа (наприклад, 1.45, -3.789654, 0.00453)"},
    "True": {"тип даних - логічний, одне із булевих значень (від англ. true - правда)"
             " Має індекс 1"},
    "False": {"тип даних - логічний, одне із булевих значень (від англ. false - брехня) "
              " Має індекс 0"},
    "list": {"тип даних - послідовності (від англ. list - список) це послідовність елементів."
             " Елементами списка є значення,"
             " причому значення можуть бути різних типів. "},
    "tuple": {"тип даних - послідовності (від англ. tuple - кортеж) це послідовність елементів будь-яких типів."
              "Кортеж записується майже так само,"
              "як список, але замість квадратних дужок використовуються круглі", },
    "range": {"тип даних - послідовності (від англ. range - діапзон) являє собою послідовність цілих чисел"
              " у певному діапазоні. Створити діапазон можна за допомогою функції range()."
              " Першим параметром цієї функції є початкове значення діапазону чисел,"
              " це число буде включено у послідовність цілих чисел. Другий параметр — кінцеве значення діапазону, "
              "це число не буде включене у послідовність."},
    "dict": {"тип даних - словники ( від англ. dictionary - словник) Словники — це невпорядковані набори"
             " пар ключ - значення. Коли ви додаєте до словника новий ключ, завжди також повинні"
             " додати туди і значення (яке можна буде змінити пізніше). Словники оптимізовані для"
             " отримання значення, якщо ви знаєте відповідний ключ, але ніяк не навпаки."
             " Щоб створити словник, треба у фігурних дужках перерахувати пари ключ - значення."
             " У парі ключ від значення відділяють двокрапкою. Якщо таких пар більше однієї, їх розділяють комою."},
    "type": {"це функція, (не пишеться через крапку, після неї в круглих душках"
             " передаємо змінну або інформацію яку обробляємо: type() - це функція"},
    "print": {"це функція, (не пишеться через крапку, після неї в круглих душках"
              " передаємо змінну або інформацію яку обробляємо: print() - це функція"},
    "input": {"це функція, (не пишеться через крапку, після неї в круглих душках"
              " передаємо змінну або інформацію яку обробляємо: input() - це функція"}

}

methods = {
    "copy": {"це метод"}
}
while True:
    data_check = input("Введіть тип даних, про який ви хочете дізнатися: ")
    if data_check in data_types:
        print(data_check, data_types[data_check])
    for a in data_types:
        if data_check == "all data":
            print(a)