print("БАЗОВІ ТИПИ ДАНИХ")
data_types = {
    "str": {"тип даних - рядки (від англ. string — рядок)"
            " Значенням величини типу str є послідовність символів,"
            " яку у виразах беруть в одинарні або подвійні лапки"},
    "int": {"тип даних - чисел (від англ. integer - ціле число) - позитивні і негативні цілі числа,"
            " а також 0 (наприклад, 4, 687, -45, 0)"},
    "float": {"тип даних - чисел (від англ. floating - плаваючий) Числа з плаваючою крапкою (float point) "
              "- дробові числа (наприклад, 1.45, -3.789654, 0.00453)"},
    "True": {"тип даних - логічний, одне із булевих значень (від англ. true - правда)"
             " Має індекс 1"},
    "False": {"тип даних - логічний, одне із булевих значень (від англ. false - брехня) "
              " Має індекс 0"},
    "list": {"тип даних - послідовності (від англ. list - список) це послідовність елементів."
             " Елементами списку є значення,"
             " причому значення можуть бути різних типів. "},
    "tuple": {"тип даних - послідовності (від англ. tuple - кортеж) це послідовність елементів будь-яких типів."
              "Кортеж записується майже так само,"
              "як список, але замість квадратних дужок використовуються круглі", },
    "range": {"тип даних - послідовності (від англ. range - діапазон) являє собою послідовність цілих чисел"
              " у певному діапазоні. Створити діапазон можна за допомогою функції range()."
              " Першим параметром цієї функції є початкове значення діапазону чисел,"
              " це число буде включено у послідовність цілих чисел. Другий параметр — кінцеве значення діапазону, "
              "це число не буде включене у послідовність."},
    "dict": {"тип даних - словники ( від англ. dictionary - словник) Словники — це невпорядковані набори"
             " пар ключ - значення. Коли ви додаєте до словника новий ключ, завжди також повинні"
             " додати туди і значення (яке можна буде змінити пізніше). Словники оптимізовані для"
             " отримання значення, якщо ви знаєте відповідний ключ, але ніяк не навпаки."
             " Щоб створити словник, треба у фігурних дужках перерахувати пари ключ - значення."
             " У парі ключ від значення відділяють двокрапкою. Якщо таких пар більше однієї, їх розділяють комою."},
    "type": {"це функція, (не пишеться через крапку, після неї в круглих дужках"
             " передаємо змінну або інформацію яку обробляємо: type() - це функція"},
    "print": {"це функція, (не пишеться через крапку, після неї в круглих дужках"
              " передаємо змінну або інформацію яку обробляємо: print() - це функція"},
    "input": {"це функція, (не пишеться через крапку, після неї в круглих дужках"
              " передаємо змінну або інформацію яку обробляємо: input() - це функція"}

}

methods = {
    "append": {"це метод (від англ. append - додати) Метод append() використовується для додавання елементу до списку."
               " Метод може отримувати тільки один параметр. Параметром методу може бути будь-який об’єкт:"
               " число, рядок, список і т.д."},
    "extend": {" це метод (від англ. extend - розширити) Даний метод extend() дозволяє розширити список."
               "Вхідним параметром методу є інший список, який додається до даного. Список розширення може"
               "бути іменованим об’актом або списком, взятим у квадратні дужки [ ]"},
    "insert": {" це метод (від англ. insert - вставити) Метод insert() дозволяє вставити новий елемент в список з"
               " заданої позиції. Метод отримує два параметри. Перший параметр – позиція вставки, яка нумерується з 0."
               " Другий параметр – ім’я об’єкту (значення), яке вставляється: <твоя змінна>.insert()"},
    "index": {" це метод (від англ. index - індекс) Метод index() дозволяє отримати значення індексу (позиції)"
              " заданого елементу списку. Метод отримує 1 параметр, який є шуканим елементом. Значення індексу, що"
              " відповідає першому елементу списку, рівне 0"},
    "count": {" це метод (від англ. count - рахувати) Метод count() повертає кількість входжень заданого"
              " елементу в списку. Метод отримує один параметр."},

}
while True:
    data_check = input("Введіть тип даних, про який ви хочете дізнатися: ")
    if data_check in data_types:
        print(data_check, data_types[data_check])
    for a in data_types:
        if data_check == "all data":
            print(a)
    if data_check in methods:
        print(data_check, methods[data_check])
    for b in methods:
        if data_check == "all method":
            print(b)
