# Домашнє завдання:
# 1) Олег дізнався, що замовляючи товар з онлайн сервісу він отримає знижку 15%.
# Описати функцію яка приймає ціну товару та повертає за яку ціну хлопець може купити товар.
#
#
# 2) Описати функцію яка приймає цифри від 1 до 7 і повертає який це день тижня. (Понеділок - П'ятниця)
# Приклад
# Функція приймає число 3
# Повернення: Середа
#
#
# 3) За контрактом Андрій отримує 2000$ в місяць. Після перегляду контракту його зарплата становить 3500$.
# Описати функції які підраховують річну зарплату в обох випадках.


# Задача №2
day_list = {
    1: "Понеділок",
    2: "Вівторок",
    3: "Середа",
    4: "Четвер",
    5: "Пятниця",
    6: "Субота",
    7: "Неділя"
}


def day_inf():

    while True:
        a = int(input("Введіть число від 1 до 7: "))

        print("Під номером", a, "День тижня", day_list[a])


day_inf()

